{
    "total_results": 1,
    "messages": [
        [
            {
                "id": "938769944244543499",
                "type": 0,
                "content": "",
                "channel_id": "938743311118766090",
                "author": {
                    "id": "937992015529013280",
                    "username": "Edenhorde Updates",
                    "avatar": "45320f4929e1c42b8dfbc668a6a2bbc2",
                    "discriminator": "3084",
                    "public_flags": 0,
                    "bot": true
                },
                "attachments": [],
                "embeds": [
                    {
                        "type": "rich",
                        "title": "FAQ",
                        "description": "⚔️   - What is Edenhorde?\n\nEdenhorde is an interactive experiment in world building. Initiating with an 8-chapter story to build the lore and immerse NFT holders in the world of Edenhorde, possibilities are endless. \n\nWe are focusing on long-term IP building which can take form in lots of shapes. This is done by, for and with the entire Edenhorde family. \n\n⚔️   - Who’s behind Edenhorde?\n\nEdenhorde is a Merit Circle project. Head over to meritcircle.io to learn more.\n\n⚔️  - What’s the future of Edenhorde?\n\nWe are currently immersing our community in an eight-chapter story. However, the narrative arc is simply a way to immerse you in what we've been cognitively immersed in for the last 6 months and to do it in a way where you can take things away from it.\n\nEdenhorde is the world we're building. The story will continue for 16 weeks but we will continue to build, develop and release other projects and benefits for holders during this period, as well as after the story ends.\n\nWhen you read an announcement from Edenhorde it means it’s happening.\n\n⚔️   - Where are all the channels?\n\nWe limited this Discord to one channel and some announcements channels for those merely visiting. Those who own an Edenhorde NFT will have access to additional channels.\n\n⚔️   - Are there any special Discord roles?\n\nYes! You can claim roles for each tribe that you own after verifying your wallet using Collab.land.\n\n⚔️   - Wait, I joined and then I got kicked, how?\n\nGive the verification bot some time, you'll all be verified after completing the process.",
                        "color": 5951477
                    }
                ],
                "mentions": [],
                "mention_roles": [],
                "pinned": false,
                "mention_everyone": false,
                "tts": false,
                "timestamp": "2022-02-03T12:16:36.210000+00:00",
                "edited_timestamp": "2022-03-01T12:45:41.077000+00:00",
                "flags": 0,
                "components": [],
                "hit": true
            }
        ]
    ],
    "analytics_id": "9a4861f5927859eaf56c21c79980e2a3"
}