{
    "total_results": 1,
    "messages": [
        [
            {
                "id": "947886244841533460",
                "type": 0,
                "content": "",
                "channel_id": "947881429688262726",
                "author": {
                    "id": "937992015529013280",
                    "username": "Edenhorde Updates",
                    "avatar": "45320f4929e1c42b8dfbc668a6a2bbc2",
                    "discriminator": "3084",
                    "public_flags": 0,
                    "bot": true
                },
                "attachments": [],
                "embeds": [
                    {
                        "type": "rich",
                        "description": "📜  ・How do I participate in the story?\n\nYou can head over to edenhorde.world to read new episodes.\n\nSome episodes are interactive for Edenhorde NFT holders. This is done by connecting your wallet to the website and selecting your preferred option. Time will tell what the effect is of your decisions.\n\n📜  ・Who can participate in the story?\nThe story will be open for everyone but interaction will solely be limited to holders of Edenhorde NFTs. \n\nThis snapshot of holders was taken today at 14:00 CET. \n\nYou have until March 11th, 14:00 CET to participate in the first chapter of the story.\n\n📜  ・Where do I see my chosen treasures?\n\nIn the bottom right corner, you can see a backpack icon you can click. This will display your inventory.\n\n📜  ・Do I need to hold an Edenhorde NFT to claim my treasures?\n\nYes. You will need to hold an Edenhorde NFT to claim your treasures.\n\n📜 ・Do I need to hold all my NFTs in one wallet or multiple?\n\nThere’s no additional benefit to distributing your NFTs among multiple wallets, so yes you can hold them all in one wallet. \n\n📜  ・How many chapters will there be in the story?\n\nThere will be 8 chapters\n\n📜 ・Who wrote the story?\n\nOur historian and author, Celia Blythe. You can follow her for additional content on Twitter; https://twitter.com/CeliaBlythe\n\n📜 ・What happens after the story?\n\nThe narrative arc is simply a way to immerse you in what we've been cognitively immersed in for the last 6 months and to do it in a way where you can take things away from it. Edenhorde is the world we're building. We will not chain the completion of the story with something else.\n\nThe story will continue for 16 weeks but we will continue to build, develop and release other things for holders during this period, and when the story ends. \n\n📜 ・ Where can I talk about the story?\n\nYou can join the conversation in <#947804594577236029>",
                        "color": 5951477
                    }
                ],
                "mentions": [],
                "mention_roles": [],
                "pinned": false,
                "mention_everyone": false,
                "tts": false,
                "timestamp": "2022-02-28T16:01:31.645000+00:00",
                "edited_timestamp": "2022-03-01T15:49:37.126000+00:00",
                "flags": 0,
                "components": [],
                "hit": true
            }
        ]
    ],
    "analytics_id": "7effa49fc08b5eefe72cc78580df245f"
}